Repository: Sennt03/prueba-tecnica-posts
Catalog: frontend/src/locale/messages.*.xlf
Languages: fr

# welcome-message
source: Bienvenido<span style="color:#4da6ff;">.</span>
fr: Bienvenue<span style="color:#4da6ff;">.</span>

source: No tienes una cuenta? <a routerLink="../register">Registrarme</a>
fr: Vous n'avez pas de compte ? <a routerLink="../register">S'inscrire</a>

source: *ingrese un email válido
fr: *entrez un e-mail valide

source: *requerido
fr: *requis

# password_placeholder
source: Contraseña
fr: Mot de passe

source: *mínimo 8 caracteres
fr: *minimum 8 caractères

# login-button
source: Iniciar sesión
fr: Se connecter

# login-succes-a
source: Bienvenido!
fr: Bienvenue !

# login-err-b
source: Credenciales inválidas!
fr: Identifiants invalides !

source: Crea una cuenta<span style="color:#4da6ff;">.</span>
fr: Créez un compte<span style="color:#4da6ff;">.</span>

source: Ya estas registrado? <a routerLink="../login" >Inicia sesión</a>
fr: Déjà inscrit ? <a routerLink="../login" >Connectez-vous</a>

source: *ingrese un email valido
fr: *entrez un e-mail valide

source: *debe tener mínimo 8 letras
fr: *doit contenir au moins 8 caractères

source: *contraseña muy debil
fr: *mot de passe trop faible

# password_confirm_placeholder
source: Confirmar contraseña
fr: Confirmer le mot de passe

source: *contraseñas no coinciden
fr: *les mots de passe ne correspondent pas

source: Cancelar
fr: Annuler

# signup-button
source: Crear cuenta
fr: Créer un compte

# registe-success-b
source: Registrado correctamente!
fr: Enregistré avec succès !

# register-err-b
source: El correo ya esta registrado!
fr: L'adresse e-mail est déjà enregistrée !

# session_message
source: Sesión caducada!
fr: Session expirée !

# name-and-message
source: <i class="fas fa-feather-alt"></i> David Ruiz - Prueba Técnica
fr: <i class="fas fa-feather-alt"></i> David Ruiz - Test technique

# inicio-text
source: <i class="fas fa-home"></i> Inicio
fr: <i class="fas fa-home"></i> Accueil

# new-post
source: <i class="fas fa-plus"></i> Nuevo Post
fr: <i class="fas fa-plus"></i> Nouveau post

# logout-btn
source: <i class="fa-solid fa-right-from-bracket"></i> Salir
fr: <i class="fa-solid fa-right-from-bracket"></i> Se déconnecter

# title-new
source: Título
fr: Titre

# title_placeholder
source: Ingresa un título
fr: Entrez un titre

# validation-new
source: *debe tener mínimo 3 letras
fr: *doit contenir au moins 3 caractères

# validation-new-required
source: *requerido
fr: *requis

source: Contenido
fr: Contenu

# content_placeholder
source: Escribe tu post...
fr: Écrivez votre post...

# validation-new-min-20
source: *contenido con mínimo 20 letras
fr: *contenu d'au moins 20 caractères

# validation-new-min-required
source: *requerido
fr: *requis

# edit_post_title
source: Editar post
fr: Modifier le post

# create_post_title
source: Crea un post
fr: Créer un post

# error-message
source: Fallo al cargar el post!
fr: Échec du chargement du post !

# error-message-edit-c
source: Editado correctamente!
fr: Modifié avec succès !

# error-message-created-c
source: Creado correctamente!
fr: Créé avec succès !

# error-message-edit-b
source: Fallo al editar!
fr: Échec de la modification !

# error-message-create-b
source: Fallo al crear!
fr: Échec de la création !

# comments-comp
source: <i class="fas fa-comment"></i> Comentarios...
fr: <i class="fas fa-comment"></i> Commentaires...

# comentar
source: <i class="fas fa-plus"></i> comentar
fr: <i class="fas fa-plus"></i> commenter

# see-more-comment
source: Ver más
fr: Voir plus

# delete_confirm_message
source: ¿Estás seguro de eliminar este comentario?
fr: Êtes-vous sûr de vouloir supprimer ce commentaire ?

# error-message-loading
source: Cargando...
fr: Chargement...

# error-message-see-more
source: Ver mas
fr: Voir plus

# error-message-close
source: Cerrar
fr: Fermer

# error-message-nohas
source: No hay comentarios! - Click para recargar
fr: Pas de commentaires ! - Cliquez pour recharger

# error-message-added
source: Comentario añadido!
fr: Commentaire ajouté !

# error-message-created-error
source: Error al crear el comentario!
fr: Erreur lors de la création du commentaire !

# error-message-eliminated
source: Comentario eliminado correctamente!
fr: Commentaire supprimé avec succès !

# error-message-error-to-elim
source: Error al eliminar!
fr: Erreur lors de la suppression !

# no-posts
source: No hay posts creados. <br>¡Crea uno!
fr: Aucun post créé. <br>Créez-en un !

# delete_confirm_message_post
source: ¿Estás seguro de eliminar este post?
fr: Êtes-vous sûr de vouloir supprimer ce post ?

# error-message_success
source: Post eliminado correctamente!
fr: Post supprimé avec succès !

# confirm_component_shared
source: Confirmación
fr: Confirmation

# confirm_component_shared_accept
source: Aceptar
fr: Accepter

# confirm_component_shared_cancel
source: Cancelar
fr: Annuler

# message_write_you_want
source: Por favor escribe lo que deseas:
fr: Veuillez écrire ce que vous souhaitez :

# message_input_placeholder
source: Escribe aquí...
fr: Écrivez ici...

source: Aceptar
fr: Accepter

# edit-message-input-d
source: Edita el comentario
fr: Modifier le commentaire

# create-message-input-d
source: Ingresa un comentario
fr: Entrez un commentaire
